---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ContourLabelsPrimaryOnly
source: html/d2797e4c-780e-992c-a4e6-09074da319c3.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ContourLabelsPrimaryOnly Property

"Label primary contours only"

## Syntax (C#)
```csharp
public static ForgeTypeId ContourLabelsPrimaryOnly { get; }
```